; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	thermograph2 - mode
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star8 - direction
	GroundStation14 - direction
	Star12 - direction
	Star13 - direction
	GroundStation0 - direction
	Star7 - direction
	Star9 - direction
	GroundStation6 - direction
	Star10 - direction
	Star1 - direction
	GroundStation5 - direction
	Star11 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
	Star20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star10)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation14)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star12)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(pointing satellite2 Star20)
	(have_image Star15 thermograph2)
	(have_image Planet16 thermograph2)
	(have_image Star17 thermograph2)
	(have_image Planet18 thermograph1)
	(have_image Star20 thermograph1)
	(have_image Phenomenon21 thermograph2)
))

)

; plan
1. (turn_to satellite2 groundstation6 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation6)
   goals met: 0 of 8
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite2 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite2 planet18 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 planet18)
   goals met: 0 of 8
5. (take_image satellite2 planet18 instrument3 thermograph1)
   added: (have_image planet18 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite2 planet16 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet16)
   goals met: 1 of 8
7. (take_image satellite2 planet16 instrument3 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon21 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 phenomenon21)
   goals met: 2 of 8
9. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon21 instrument3 thermograph2)
   added: (have_image phenomenon21 thermograph2)
   goals met: 4 of 8
11. (turn_to satellite2 star15 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 star15)
   goals met: 4 of 8
12. (take_image satellite2 star15 instrument3 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 5 of 8
13. (turn_to satellite2 star17 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star17)
   goals met: 5 of 8
14. (take_image satellite2 star17 instrument3 thermograph2)
   added: (have_image star17 thermograph2)
   goals met: 6 of 8
15. (turn_to satellite2 star20 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star20)
   goals met: 7 of 8
16. (take_image satellite2 star20 instrument3 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 8 of 8
